; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph4 - mode
	infrared3 - mode
	thermograph1 - mode
	thermograph2 - mode
	image0 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation6 - direction
	Star4 - direction
	Star5 - direction
	GroundStation1 - direction
	Star7 - direction
	Star0 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star7)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument5 thermograph1)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 Star5)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph4)
	(supports instrument6 thermograph1)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 Star7)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
)
(:goal (and
	(pointing satellite2 Star5)
	(have_image Star8 thermograph1)
	(have_image Planet9 spectrograph4)
	(have_image Star10 infrared3)
	(have_image Planet11 thermograph1)
	(have_image Phenomenon12 infrared3)
))

)

; plan
1. (turn_to satellite3 groundstation1 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 groundstation1)
   goals met: 0 of 6
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 6
3. (calibrate satellite3 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 0 of 6
4. (turn_to satellite3 phenomenon12 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 phenomenon12)
   goals met: 0 of 6
5. (turn_to satellite0 groundstation2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 6
6. (take_image satellite3 phenomenon12 instrument5 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 1 of 6
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
8. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 6
9. (turn_to satellite0 planet9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet9)
   goals met: 1 of 6
10. (take_image satellite0 planet9 instrument1 spectrograph4)
   added: (have_image planet9 spectrograph4)
   goals met: 2 of 6
11. (turn_to satellite2 star5 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star5)
   goals met: 3 of 6
12. (turn_to satellite3 planet11 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 planet11)
   goals met: 3 of 6
13. (take_image satellite3 planet11 instrument5 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 4 of 6
14. (turn_to satellite3 star10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star10)
   goals met: 4 of 6
15. (take_image satellite3 star10 instrument5 infrared3)
   added: (have_image star10 infrared3)
   goals met: 5 of 6
16. (turn_to satellite3 star8 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star8)
   goals met: 5 of 6
17. (take_image satellite3 star8 instrument5 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 6 of 6
